[
     {
          "time":[2025,7,13,12,4],
          "text":"The official average plate gaem wiki has been moved to Miraheze. The average plate gaem wiki on Fandom has since been removed."
     },
     
     {
          "time":[2025,6,26,14,40],
          "text":"fixed a bug where quest refreshes would cause the season UI not to not show up"
     },
     
     {
          "time":[2025,6,22,18,45],
          "version":"v1.34",
                  "alias":"GALACTIC PLATES",
          "backdrop":"rbxassetid://74064756685213",
             "image":"rbxassetid://96199214298187",
          "text":"THE VERY FIRST 100% FREE PLATE PASS IS HERE: GALACTIC PLATES PART 1! 🪐 while this part was mainly focused on the pass itself, expect PART 2 to have tons of gameplay content, like events, maps, and a power! 🛰️ \n\nadditions:\n- 👽 introducing the PLATE PASS! a system like the 'battle pass' that's 100% FREE! earn cool cosmetics for the first GALACTIC PLATES season!\n    - 💰 themed skins, an exclusive title, resources, and more!\n    - 📋 your XP from quests will help you progress through the king's path! season quests have also been added!\n    - all PLATE PASS themed cosmetics will be re-released after 1 year in the shop\n\n- 👕 new skins!\n    - 👽 alien pal (sunflower pal)\n    - 🔱 alien artifact (trident)\n\n- 🔨 new gear skins:\n    - 🦜 parrot cannon (rocket launcher)\n    - 🐟 swordfish sword (sword)\n    - 🪙 pirate brew (bloxy cola)\n    - 💦 water gun (paintball gun)\n    \n    - ⚔️ lightsaber (sword)\n    - 🛸 ufo-rang (boomerang)\n    \n    -  🍔 burger bait (speed coil)\n\n- 🏅 2 new badges!\n- new quests!\n\nmaps:\n- 🛰️ SATELLITE map (classic & mega classic)\n- 🔱 MARINE map (classic & mega classic)\n\nevents:\n- 👽 alien invasion disaster can occur in regular rounds!\n- 🛸 alien abduction\n- 🍄 alien fungus\n\nimprovements:\n- 📱 various ui improvements\n\n- 👽 aliens can spawn with laser guns!\n- ❓ special powers are now included in the 'randomizer' charm pool\n\n- the volcano map now has more tropical plates\n- vaulted winter gears: 'snow cannon' and 'snow bomb'\n- added power juice generation visuals to the legacy/mobile power UI\n\nbalance changes:\n- parrot pal: added hybrid ability 'retriever': every time you defeat an enemy, you steal one of their gears (if they have one)\n- jack-o-launcher:\n    - increased fire zone duration, but halved fire effect duration\n    - damage reduced from (15/20/25/30) > (10/13/16/20)\n"
     },
     
     {
          "time":[2025,6,1,23,4],
          "version":"v1.33.3",
          "isPatch": true,
          "text":"schools out, platers! i deeply apologize for my absence during these last few weeks. stay tuned for a summer splash, coming soon! 🪐 this patch includes a power juice rework, restoring of maps, bug fixes, and small balance changes!\n\nadditions:\n- ⚡ new power juice regeneration system!\n    - based on seconds alive rather than events survived\n    - decreases from 24 > 12 seconds per power juice from difficulties 1.0 > 5.0\n\nimprovements:\n- 🏨 added HOTEL map to baseplate!\n- returned chaos canyon and glass houses to their respective modes!\n- ❌ vaulted disaster mode :(\n\n- added SPOOKY animations for the spooky egg skin\n\nbug fixes:\n- trees and campfires no longer duplicate in glass houses\n- people's teammates on duos will no longer be sentenced to the VOID on spawn during the housing modifier\n- charms are no longer scared off when joining new servers\n- fixed happy home's seizure\n- fixed flashbang only stunning one player\n- fixed resplendent & powerless badge\n- changed description of the 'demolotioner' hybrid of 'bomb' to apply to LETHAL and NON-LETHAL explosions (yes it's now intentional) \n\nbalance changes:\n- hermes' boots: restored to its original state before rework\n- shellshock: you will be dismounted instead of entering a spasm if you crash\n- sunflower pal: now activates at <5 power juice rather than 4+ power juice\n\nthanks for reading, and stay tuned!"
     },
     
     {
          "time":[2025,5,30,19,59],
          "text":"WHAT A DISASTER...\n\ngreetings platers!\n\nin the coming days, disaster mode has a possibility of being vaulted until i can create a proper solution for it over the next few weeks. \n\nwith disaster mode, i wanted to make a fresh, fun new mode that introduced a new way to play apg. disaster mode, in my eyes, was a way to reinvent both the way people play average plate gaem, and the way that i develop it. this was not only something i envisioned to be fresh for the playerbase, but also for me, as it would give me new opportunities to build new maps and game mechanics.\n\nunfortunately, with time constraints (delays...)  (school...) (exams...) i was unable to deliver. developing a new mode is almost like developing a new game, which is very hard to fit in one update. for that reason, there were an incredible amount of bugs, very limited content, and frankly, the mode itself was disappointing. for that, i deeply apologize. in a way it felt like i betrayed both the audience and also myself--and that's not really something that's easily forgiven.\n\nas much as i want to immediately fix these issues, it just doesn't make sense to focus all of my effort on this single mode for the time being--this is one of the struggles of being a solo developer™. for that reason, i think disaster mode will be best vaulted for now and reintroduced as disaster mode 2.0 when the issues have been fixed. i want to cater this mode to be perfect for your playstyle.\n\nthanks for understanding, and happy plating! ☀️"
     },

     {
          "time":[2025,5,12,7,43],
          "text":"hermes change: the speed increases as you approach 70% HP instead of you needing to be there immediately by (60/70/75/100)%"
     },
     
     {
          "time":[2025,5,11,21,3],
          "version":"v1.33.2",
          "isPatch": true,
          "text":"🐰 it's hardly easter anymore, but here are a few more skins in case you want to spend your leftover eggs! i'm still studying for my final exams, but hopefully afterwards i can rebalance the disaster update a bit more.\n\nadditions:\n- +7 days for the easter event (in case you were still missing some eggs!)\n\n- ✨ (FINALLY) added the 5 super auras!\n    - thundering aura revamped\n\n- 👚 2 egg skins!\n    - winged egg of flames\n    - coiled egg of gravity\n\nimprovements:\n- 🌠 disaster mode can only show up in the voting pool every 45 minutes\n    - i realize that with as little disasters it has right now, it's not as great as it could be. i'm still looking into new features and disasters to add to the mode, though - join the community server in case you're interested in requesting new features, disasters, or maps!\n- added sudden death to disaster mode\n\n- modifiers are half as common in disaster mode\n- fixed a bug where XP couldn't be earned in disaster mode\n\n- you now earn more xp per event\n    \n- fixed a bug where buildings would randomly fall off the walls of cavern\n- fixed a bug where daily rewards and streak wouldn't update\n    \nbalance changes:\n- hermes boots: instead of increasing with the amount of power juice you have, it will fully activate when you have under 70% HP"
     },
     
     {
          "time":[2025,4,30,0,2],
          "version":"v1.33.1",
          "isPatch": true,
          "text":"improvements:\n- fixed a bug where loadouts, emote wheel, charms, and some gear skins wouldn't save\n    - if you lost a gear skin, message @dukzae to get receive it back!\n- fixed a bug where the only disaster events that appeared were lava eruption and sea mines\n- fixed a bug where bomb didn't work\n\n- the auras that were listed in the last update notes will be added in a few days! - somehow they weren't implemented.\n\nkeep on the lookout for easter pt. 2!!"
     },
     
     {
        "time":[2025,4,27,19,40],
        "text":"most of the disaster bugs have been fixed! sorry for the bumpy release, and thank you for your patience!"
    },
     
     {
        "time":[2025,4,27,18,30],
        "version":"v1.33",
        "alias":"THE DISASTER UPDATE",
        "backdrop":"rbxassetid://81944353629967",
        "image":"rbxassetid://98337984562982",
        "text":"🔥 WELCOME TO THE APG DISASTER UPDATE!\n\nadditions:\n- 🔥 introducing the long-awaited DISASTER MODE!\n    - 😎 survive huge DISASTERS instead of EVENTS!\n    - 🛒 mid-round intermissions to buy from the DISASTER DEPOT and build!\n    - 🌠 intensity ramps up based on difficulty and time!\n\n- 🔨 introducing GEAR SKINS!\n    - 👁️ overseer tripmine\n    - converted all gear power skins to gear skins\n\n- ✨ 6 new super auras\n- 👚 6 new skins:\n    - 🌿 peashooter\n    - 💣 barrel of KABOOM!\n    - 🌼 frostflower\n    - 🪩 boogie bomb\n    - 🐡 abomination bait\n    - 🕷️ spooky egg\n    + many more on their way!\n\nmaps:\n- 🌊 MARINE map (disaster & mega disaster)\n- 🏢 DISASTER HOTEL map (disaster & mega disaster)\n- 🧇 WAFFLE map (classic & mega classic)\n\nimprovements:\n- 📱 various UI improvements\n\n- solar system planets longer orbit (planets will still spawn at random points)\n\n- lucky gear block can now shuffle itself\n- fixed hookshot hooking ghosts\n- fixed topbar glitches\n\ndisasters:\n- 🌠 meteor shower\n- ⚡ thunder storm\n- 🌊 flash flood\n- 👁️ all-seeing eye\n- 🏴‍☠️ pirate invasion\n- 👽 alien invasion\n- 🧟‍ zombie uprising \n- ⌛ sandstorm\n+ many more on their way!\n\nevents:\n- 🤑 clam\n- 🪼 jellyfish party\n- 🌱 acorn rain\n\nbalance changes:\n- egg of radical rocketeering: \n    - decreased power juice cost from 3 > 2\n    - decreased damage from (15/20/25/30) > (8/10/12/16)\n- frostfire: added a charge up time of 3 seconds\n- superbloom: you will now retain a percentage of the MHP after the duration"
    },
    
    {
        "time":[2025,4,20,3,9],
        "version":"v1.32",
        "backdrop":"rbxassetid://80007997320814",
        "image":"rbxassetid://119651397186078",
        "text":"🐰🥕 easter is back for a limited time! unlock egg powers, skins, accessories, and more! stay tuned for part 2, along with something else huge on its way..."
    },
    
    {
        "time":[2025,3,2,17,46],
        "version":"v1.31",
        "alias":"THE MASTERY UPDATE",
        "backdrop":"rbxassetid://76478891494706",
        "image":"rbxassetid://112596221811950",
        "text":"I'M BACK FROM MY BREAK! this update introduces POWER MASTERIES, a new POWER and SKINS, and TONS OF BALANCE CHANGES!\n\nadditions:\n- 🏆 added POWER MASTERIES, and removed the XP requirement to upgrade powers!\n    - XP is now used to unlock masteries!\n    - many diamond III powers have their own titles!\n- 🏷️ customize your CHAT COLOR in the profile editor!\n\n- 🔃 added the INVERTED charm!\n\n- ⚡ new power:\n    - 🌷 SUPERBLOOM\n\n- 👚 new skins:\n    - water balloon: ✨ pocket dimension\n    - superbloom: 🎂 cake surprise\n\nimprovements:\n- ⚡️ passive powers will now receive XP for every passively-generated power juice earned in a match\n- 📱 various UI improvements\n\nbalance changes:\n- necromancer's staff:\n    - added hybrid passive: 'tomb raiser': when you kill an enemy, a zombie is summoned beneath them! 5 second cooldown\n- chair:\n    - added hybrid passive: 'sedentary': every (25/24/22/20) seconds while sitting, you gain +5 max HP\n- troll lootbox:\n    - added hybrid passive: 'unboxing': when you kill an enemy, you have a (20/30/40/50)% chance to receive a random gear\n- frostfire:\n    - added hybrid active: 'create an icy explosion that freezes enemies and leaves behind a zone of fire with a (10/12/14/16) stud radius'\n    - frostfire's old passive is now its hybrid passive: 'thermal protection'\n- jack-o-launcher: explosions will now leave behind zones of fire\n- puffer pal: knockback is now consistent\n- shark bait: now instantly kills, but has a longer wait period with an indicator\n- horn of the forlorn blizzard: increased range from 14 > 16\n\nnow that i'm back from my break, i would love to start adding more events and maps to the game! stay tuned, and as always-- happy plating!"
    },
    
    {
        "time":[2025,1,6,20,30],
        "text":"bug fixes! fixed crate animations, inventory glitches, boomerang bugs, and an issue with the egg powers."
    },
    
    {
        "time":[2024,12,30,1,20],
        "text":"bug fixes! quick join will no longer try to send you to full servers, and quests have been fixed."
    },
    
    {
        "image":"rbxassetid://76796338618995",
        "version":"v1.30",
        "time":[2024,12,29,8,44],
        "text":"welcome to v1.30! this update brings back SUPA-SNOWMAN (with new rewards!), an ADVENT CALENDAR, TONS OF SKINS, and more!\n\nadditions:\n- ⛄🔥 the SUPA-SNOWMAN boss is back for a limited time! but it has returned back for REVENGE... \n    - earn 5 different boss rewards!\n\n- 🎁 advent calendar! join at least 14 times in the next 28 days to get all of the rewards!\n\n- 💰 gem prices discount!\n\n- 📜 new charm quests!\n- 🎮 added a QUICK PLAY button which lets you quickly join another round!\n\n- ⚡ new power:\n    - force barrier\n\n- 👚 new skins:\n    - hermes' boots: 🌨️ trailfreezer\n    - shellshock: 🧊 frostshock\n    - sugary coffee: ⭐ super star\n    - sunflower pal: 😺 cat pal\n   \nimprovements:\n- ⚡ significantly boosted loading times\n\ngears:\n- 🧊 snow bomb\n\nbalance changes:\n- flashbang: increased radius from 12 > 16\n- parrot retriever: increased power steal chance from (0/15/30/50) > (25/50/75/100)\n- blizzard horn: increased range from 12 > 14\n- water balloon: now triggers instantly\n\npower juice requirements:\n- summon nuke: 5 > 4\n- tripmine: 5 > 4\n- lootbox troll: 5 > 4\n",
     
        "backdrop":"rbxassetid://130811421927112",
        "alias":"SUPA-SNOWMAN'S RETURN"
    },
    
    {
        "text":"HE WILL RETURN. COMING VERY SOON.",
        "time":[2024,12,28,7,10],
        "image":"rbxassetid://101978128032293"
    },
    
    {
        "time":[2024,12,12,18,56],
        "text":"fixed a bug where necromancer's staff could not be purchased for gems"
    }
]
